app/controllers/activity_inventories_controller.rb

  def show
    @activity_inventory = ActivityInventory.find(params[:id])
---
SELECT * FROM "activity_inventories" WHERE ("activity_inventories"."id" = 980190962)

  def edit
    @activity_inventory = ActivityInventory.find(params[:id])
---
SELECT * FROM "activity_inventories" WHERE ("activity_inventories"."id" = 980190962)

  def create
    @activity_inventory = ActivityInventory.new(params[:activity_inventory])

    respond_to do |format|
      if @activity_inventory.save
---
INSERT INTO "activity_inventories" ("created_at", "updated_at", "activity_id", "priority") VALUES('2009-12-29 09:48:36', '2009-12-29 09:48:36', NULL, NULL)

  def update
    @activity_inventory = ActivityInventory.find(params[:id])
---
SELECT * FROM "activity_inventories" WHERE ("activity_inventories"."id" = 980190962)

  def destroy
    @activity_inventory = ActivityInventory.find(params[:id])
    @activity_inventory.destroy
---
SELECT * FROM "activity_inventories" WHERE ("activity_inventories"."id" = 980190962)
DELETE FROM "activity_inventories" WHERE "id" = 980190962