app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT * FROM "activities"

  def select
    @activities = Activity.all
---
SELECT * FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def edit
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("comment", "created_at", "updated_at", "priority", "deadline", "description", "estimated_pomodoros") VALUES(NULL, '2009-12-29 12:13:12', '2009-12-29 12:13:12', NULL, NULL, NULL, NULL)

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
UPDATE "activities" SET "updated_at" = '2010-01-13 13:34:14', "comment" = 'comment', "description" = 'description' WHERE "id" = 1

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
DELETE FROM "activities" WHERE "id" = 1