app/controllers/pomodoros_controller.rb

  def index
    @pomodoros = Pomodoro.all
---
SELECT * FROM "pomodoros"

  def show
    @pomodoro = Pomodoro.find(params[:id])
---
SELECT * FROM "pomodoros" WHERE ("pomodoros"."id" = 1)

  def edit
    @pomodoro = Pomodoro.find(params[:id])
---
SELECT * FROM "pomodoros" WHERE ("pomodoros"."id" = 1)

  def create
    @pomodoro = Pomodoro.new(params[:pomodoro])

    respond_to do |format|
      if @pomodoro.save
---
INSERT INTO "pomodoros" ("end_time", "created_at", "interruption_type", "updated_at", "activity_id", "start_time") VALUES(NULL, '2009-12-29 12:13:13', NULL, '2009-12-29 12:13:13', NULL, NULL)

  def update
    @pomodoro = Pomodoro.find(params[:id])
---
SELECT * FROM "pomodoros" WHERE ("pomodoros"."id" = 1)

  def destroy
    @pomodoro = Pomodoro.find(params[:id])
    @pomodoro.destroy
---
SELECT * FROM "pomodoros" WHERE ("pomodoros"."id" = 1)
DELETE FROM "pomodoros" WHERE "id" = 1