app/controllers/today_activities_controller.rb

SELECT * FROM "today_activities" WHERE ("today_activities"."today" = '2010-01-05') LIMIT 1
---
  def index
    @today = Date.today
    puts @today
    @today_activities = TodayActivity.find(:all,
      :conditions => "today = '" + @today.to_s() +"'")

SELECT "today_activities".* FROM "today_activities" , activities as a on today_activities.activity_id = a.id WHERE (today = '2010-01-05') ORDER BY a.priority
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def reload
    puts "reload"
    #@today = Date.today
    puts "---Start----"
    puts params[:start]
    puts "-------------"
    date = Date.civil(params[:start][:year].to_i, params[:start][:month].to_i, params[:start][:day].to_i)
    puts "---Date----"
    puts date.to_s
    puts "-------------"

    @today_activities = TodayActivity.find(:all,
      :conditions => "today = '" + date.to_s() +"'",
      :joins => ", activities as a on today_activities.activity_id = a.id",
      :order => "a.priority")

SELECT * FROM "today_activities" WHERE ("today_activities"."id" = 980190962)
---
  def show
    @today_activity = TodayActivity.find(params[:id])

SELECT * FROM "today_activities" WHERE ("today_activities"."id" = 980190962)
---
  def edit
    @today_activity = TodayActivity.find(params[:id])

INSERT INTO "today_activities" ("today", "created_at", "updated_at", "activity_id") VALUES(NULL, '2010-01-13 12:10:23', '2010-01-13 12:10:23', NULL)
---
  def create
    @today_activity = TodayActivity.new(params[:today_activity])

    respond_to do |format|
      if @today_activity.save

SELECT * FROM "today_activities" WHERE ("today_activities"."id" = 980190962)
---
  def update
    @today_activity = TodayActivity.find(params[:id])

SELECT * FROM "today_activities" WHERE ("today_activities"."id" = 980190962)
DELETE FROM "today_activities" WHERE "id" = 980190962
---
  def destroy
    @today_activity = TodayActivity.find(params[:id])
    @today_activity.destroy